post/Games/Terraria/Terraria_note.org
#+title: 其他的泰拉笔记
#+date: <2025-08-12 二 18:07>
#+description: 不仅限于战士使用的泰拉笔记（如刷怪方式，怪物AI等）

#+SETUPFILE: ../../../setup.setup

* 杂项
- 玩家中心：位于玩家2x3位置的左上角
* 怪物AI
** 战士AI
特点：在玩家上面时想下平台，在下面或者持平时上平台甚至跳跃。想跳跃时如果头顶一格
有方块就不会跳起来（部分怪的高度比较矮所以方块的具体位置比较灵活）
** 致命球（日食）
在日食期间，刷怪处与玩家有阻挡时生成

接近玩家时逻辑上有两个阶段：
1) 屏外阶段：\\
   要求处于玩家中心往左往右37格之外(上下超出了刷怪范围，不进行计算)，此阶段能穿墙
2) 屏内阶段：\\
   在上述范围以内，如果需要恢复到屏外阶段需要到更大的范围（未计算），此阶段不能
   穿墙。会走直线靠近玩家。如果路径被挡住则会进行寻路，碰到方块阻挡后改变行进方
   向，比较像扫地机，直到找到能直接冲向玩家的路径然后伸出尖刺向玩家冲刺。

应用：
1) 刷怪场应避免让其在屏外阶段进入穿墙状态然后直接找到玩家
2) 在第二阶段将其困住用岩浆烫死
